<a href="https://colab.research.google.com/github/ARYANJATHAR/InfosysSpringboardProject/blob/main/TASK4/SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## SQL  - STRUCTURED QUERY LANGUAGE

1.What is SQL, and why is it important in data analytics?

Ans1.
SQL (Structured Query Language) is a programming language used to manage, manipulate, and query data in relational databases efficiently.
for managing and querying databases, essential in data analytics for extracting, transforming, and analyzing data efficiently.

In [2]:
import sqlite3

# Create a database in memory
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create two sample tables
cursor.execute('''
CREATE TABLE employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    department_id INTEGER
)
''')

cursor.execute('''
CREATE TABLE departments (
    id INTEGER PRIMARY KEY,
    department_name TEXT
)
''')

In [3]:
# Insert data into the tables
cursor.executemany('INSERT INTO employees (id, name, department_id) VALUES (?, ?, ?)', [
    (1, 'Alice', 101),
    (2, 'Bob', 102),
    (3, 'Charlie', 103),
    (4, 'David', None)
])

cursor.executemany('INSERT INTO departments (id, department_name) VALUES (?, ?)', [
    (101, 'HR'),
    (102, 'IT'),
    (104, 'Finance')
])

# Commit changes
conn.commit()

In [7]:
cursor.execute('SELECT * FROM employees')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 101)
(2, 'Bob', 102)
(3, 'Charlie', 103)
(4, 'David', None)

2.Explain the difference between INNER JOIN, LEFT JOIN, RIGHT JOIN, and FULL OUTER JOIN.

ANS2. Joins in SQL combine rows from two or more tables based on a related column.

INNER JOIN: Matches rows with common keys in both tables.

LEFT JOIN: Returns all rows from the left table and matching rows from the right.

RIGHT JOIN: Returns all rows from the right table and matching rows from the left.

FULL OUTER JOIN: Returns all rows from both tables with NULLs for unmatched rows.

In [ ]:
# 1. INNER JOIN
print("INNER JOIN:")
cursor.execute('''
SELECT employees.name, departments.department_name
FROM employees
INNER JOIN departments ON employees.department_id = departments.id
''')
for row in cursor.fetchall():
    print(row)

INNER JOIN:
('Alice', 'HR')
('Bob', 'IT')

In [ ]:
# 2. LEFT JOIN
print("\nLEFT JOIN:")
cursor.execute('''
SELECT employees.name, departments.department_name
FROM employees
LEFT JOIN departments ON employees.department_id = departments.id
''')
for row in cursor.fetchall():
    print(row)

LEFT JOIN:
('Alice', 'HR')
('Bob', 'IT')
('Charlie', None)
('David', None)

In [ ]:
# 3. RIGHT JOIN (Not supported directly in SQLite, emulate using LEFT JOIN)
print("\nRIGHT JOIN (Emulated):")
cursor.execute('''
SELECT employees.name, departments.department_name
FROM departments
LEFT JOIN employees ON employees.department_id = departments.id
''')
for row in cursor.fetchall():
    print(row)

RIGHT JOIN (Emulated):
('Alice', 'HR')
('Bob', 'IT')
(None, 'Finance')

In [ ]:
# 4. FULL OUTER JOIN (Emulated using UNION)
print("\nFULL OUTER JOIN (Emulated):")
cursor.execute('''
SELECT employees.name, departments.department_name
FROM employees
LEFT JOIN departments ON employees.department_id = departments.id
UNION
SELECT employees.name, departments.department_name
FROM departments
LEFT JOIN employees ON employees.department_id = departments.id
''')
for row in cursor.fetchall():
    print(row)

FULL OUTER JOIN (Emulated):
(None, 'Finance')
('Alice', 'HR')
('Bob', 'IT')
('Charlie', None)
('David', None)

3.What is the difference between WHERE and HAVING clauses?

Ans3. WHERE Clause: The WHERE clause filters records in a query based on specified conditions before any grouping or aggregation is applied.

HAVING Clause: The HAVING clause filters grouped data based on conditions applied to aggregate functions after the GROUP BY clause.

In [ ]:
import sqlite3

# Create an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a table
cursor.execute('''
CREATE TABLE sales (
    id INTEGER PRIMARY KEY,
    product TEXT,
    category TEXT,
    amount REAL
)
''')

# Insert sample data
cursor.executemany('INSERT INTO sales (id, product, category, amount) VALUES (?, ?, ?, ?)', [
    (1, 'Laptop', 'Electronics', 1500),
    (2, 'Phone', 'Electronics', 800),
    (3, 'Chair', 'Furniture', 200),
    (4, 'Desk', 'Furniture', 300),
    (5, 'Headphones', 'Electronics', 200),

])

# Commit changes
conn.commit()

In [ ]:
# Using WHERE Clause: Filtering rows before grouping
print("Using WHERE Clause:")
cursor.execute('''
SELECT product, category, amount
FROM sales
WHERE amount > 500
''')
for row in cursor.fetchall():
    print(row)

Using WHERE Clause:
('Laptop', 'Electronics', 1500.0)
('Phone', 'Electronics', 800.0)

In [ ]:
# Using HAVING Clause: Filtering aggregated results
print("\nUsing HAVING Clause:")
cursor.execute('''
SELECT category, SUM(amount) as total_sales
FROM sales
GROUP BY category
HAVING total_sales > 1000
''')
for row in cursor.fetchall():
    print(row)

Using HAVING Clause:
('Electronics', 2500.0)

Q.4 How do you use GROUP BY and HAVING in a query?

GROUP BY: The GROUP BY clause groups rows in a query based on one or more columns, allowing aggregate functions (like SUM, COUNT, AVG, etc.) to be applied to each group.

In [ ]:
#How do you use GROUP BY and HAVING in a query?
# Using GROUP BY and HAVING
print("Using GROUP BY and HAVING:")
cursor.execute('''
SELECT category, SUM(amount) AS total_sales
FROM sales
GROUP BY category
HAVING total_sales > 1000
''')
for row in cursor.fetchall():
    print(row)

Using GROUP BY and HAVING:
('Electronics', 2500.0)

5.Write a query to find duplicate records in a table.

ANS: Duplicate records refer to rows in a database table that have the same values in one or more columns.

In [ ]:
print("Duplicate records based on product and category:")
cursor.execute('''
SELECT product, category, COUNT(*) as count
FROM sales
GROUP BY product, category
HAVING COUNT(*) > 1
''')
for row in cursor.fetchall():
    print(row)

Duplicate records based on product and category:
('Phone', 'Electronics', 2)

6.How do you retrieve unique values from a table using SQL?

In [ ]:
#6.How do you retrieve unique values from a table using SQL?
print("Unique products and categories:")
cursor.execute('''
SELECT DISTINCT product, category
FROM sales
''')
for row in cursor.fetchall():
    print(row)

Unique products and categories:
('Laptop', 'Electronics')
('Phone', 'Electronics')
('Chair', 'Furniture')
('Desk', 'Furniture')
('Headphones', 'Electronics')

7.Explain the use of aggregate functions like COUNT(), SUM(), AVG(), MIN(), and MAX().

Ans7. - COUNT(): Counts rows.

SUM(): Calculates total.

AVG(): Calculates average.

MIN()/MAX(): Finds minimum/maximum values.

In [ ]:
# COUNT example
cursor.execute('SELECT COUNT(*) FROM sales')
print("Total number of sales records:", cursor.fetchone()[0])

# SUM example
cursor.execute('SELECT category, SUM(amount) FROM sales GROUP BY category')
print("Total sales per category:")
for row in cursor.fetchall():
    print(row)

# AVG example
cursor.execute('SELECT AVG(amount) FROM sales')
print("Average sales amount:", cursor.fetchone()[0])

# MIN example
cursor.execute('SELECT MIN(amount) FROM sales')
print("Lowest sales amount:", cursor.fetchone()[0])

# MAX example
cursor.execute('SELECT MAX(amount) FROM sales')
print("Highest sales amount:", cursor.fetchone()[0])

Total number of sales records: 6
Total sales per category:
('Electronics', 3300.0)
('Furniture', 500.0)
Average sales amount: 633.3333333333334
Lowest sales amount: 200.0
Highest sales amount: 1500.0

8.What is the purpose of a DISTINCT keyword in SQL?

Ans8. The DISTINCT keyword in SQL is used to remove duplicate records from the result set. It ensures that the query returns only unique values for the specified columns, eliminating any redundant data.

9 .Write a query to find the second-highest salary from an employee table.

In [ ]:

# cursor.execute('''
# SELECT MAX(salary)
# FROM employees
# WHERE salary < (SELECT MAX(salary) FROM employees);
# ''')

# second_highest_salary = cursor.fetchone()[0]
# print("Second highest salary:", second_highest_salary)

10.What are subqueries and how do you use them?

Ans10. A subquery is a query nested inside another query.

 It is used to retrieve data that will be used in the main query.


 Subqueries can return a single value, multiple values, or a set of results, depending on how they are structured.

 Subqueries can be used in various parts of a SQL query, such as:

SELECT clause
  
WHERE clause

FROM clause

HAVING clause

Q11.How do you combine results of two queries using UNION and UNION ALL?

UNION:

Combines the results of two or more SELECT queries and removes duplicate rows from the final result.

Columns in all queries must have the same number, data types, and order.

UNION ALL:

Combines the results of two or more SELECT queries but does not remove duplicates.

Faster than UNION because it skips the duplicate-checking step.

In [ ]:
import sqlite3

# Create an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create an employees table
cursor.execute('''
CREATE TABLE employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    salary REAL,
    department TEXT
)
''')

# Insert sample data into employees table
cursor.executemany('INSERT INTO employees (id, name, salary, department) VALUES (?, ?, ?, ?)', [
    (1, 'John', 5000, 'HR'),
    (2, 'Jane', 7000, 'Finance'),


])

# Create a contractors table
cursor.execute('''
CREATE TABLE contractors (
    id INTEGER PRIMARY KEY,
    name TEXT,
    salary REAL,
    department TEXT
)
''')

# Insert sample data into contractors table
cursor.executemany('INSERT INTO contractors (id, name, salary, department) VALUES (?, ?, ?, ?)', [
    (6, 'Eve', 7500, 'Finance'),
    (7, 'John',5000, 'HR'),
    (8, 'Jerry', 6500, 'Marketing')
])

# Commit changes
conn.commit()

# Query combining employees and contractors using UNION
union_query = '''
SELECT name, department, salary
FROM employees
UNION
SELECT name, department, salary
FROM contractors;
'''

# Query combining employees and contractors using UNION ALL
union_all_query = '''
SELECT name, department, salary
FROM employees
UNION ALL
SELECT name, department, salary
FROM contractors;
'''

# Execute and fetch UNION results
print("Results with UNION (duplicates removed):")
cursor.execute(union_query)
for row in cursor.fetchall():
    print(row)

# Execute and fetch UNION ALL results
print("\nResults with UNION ALL (duplicates included):")
cursor.execute(union_all_query)
for row in cursor.fetchall():
    print(row)

# Close connection
conn.close()

Results with UNION (duplicates removed):
('Eve', 'Finance', 7500.0)
('Jane', 'Finance', 7000.0)
('Jerry', 'Marketing', 6500.0)
('John', 'HR', 5000.0)

Results with UNION ALL (duplicates included):
('John', 'HR', 5000.0)
('Jane', 'Finance', 7000.0)
('Eve', 'Finance', 7500.0)
('John', 'HR', 5000.0)
('Jerry', 'Marketing', 6500.0)

12.What are indexes in SQL, and how do they improve query performance?

Ans6 Indexes in SQL are data structures that improve the speed of data retrieval
by creating a quick lookup mechanism for specific columns in a table, much like a book's index helps locate topics.

Without Index (Full Table Scan)
If no index exists, the database scans all rows in the table to find matching results, which is slow for large datasets.

With Index
With an index on relevant columns, the database quickly narrows down rows matching the criteria, improving performance significantly.

13.How do you optimize a slow-running SQL query?

Ans11.
 Use Indexes: Create indexes on columns involved in filtering, joining, and sorting to speed up query execution.

Analyze Query Execution Plan: Use tools like EXPLAIN to identify inefficiencies and optimize the query path.

**Avoid SELECT ***: Select only the necessary columns to reduce processing time and memory usage.

14.What are views in SQL, and when would you use them?

Ans2.
A view in SQL is a virtual table that represents the result of a stored query.

It doesn't store data itself but fetches data from the underlying tables based on the defined query.

Views simplify complex queries, provide data abstraction, and enhance security by restricting access to certain columns or rows.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a sample 'employees' table
cursor.execute('''
CREATE TABLE employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    salary REAL,
    department TEXT
)
''')

# Insert sample data into 'employees' table
cursor.executemany('''
INSERT INTO employees (name, salary, department) VALUES (?, ?, ?)
''', [
    ('John', 6000, 'IT'),
    ('Alice', 4000, 'HR'),
    ('Bob', 8000, 'IT'),
    ('Eve', 3000, 'Finance'),
    ('Charlie', 7000, 'IT')
])

# Create a view to show employees with salary greater than 5000
cursor.execute('''
CREATE VIEW employee_summary AS
SELECT name, department, salary
FROM employees
WHERE salary > 5000
''')

# Query the view
cursor.execute('SELECT * FROM employee_summary')
rows = cursor.fetchall()

# Display the result
for row in rows:
    print(row)

# Close the connection
conn.close()

('John', 'IT', 6000.0)
('Bob', 'IT', 8000.0)
('Charlie', 'IT', 7000.0)

Q.13What is the difference between a stored procedure and a function in SQL?

Stored Procedure: A stored procedure is a set of SQL statements that perform a task, such as modifying data, and can return no value or multiple results.

It is used to perform operations like INSERT, UPDATE, DELETE, or complex queries.

Function: A function is designed to return a single value and is used to perform calculations or data transformations.

It cannot modify the database (i.e., no INSERT, UPDATE, or DELETE operations).

4.Explain the difference between TRUNCATE, DELETE, and DROP commands.
Ans4

TRUNCATE:

Purpose: Removes all rows from a table but does not log individual row deletions, making it faster than DELETE. It cannot be rolled back if executed in a transaction.

DELETE:

Purpose: Removes specific rows from a table based on a WHERE condition. Unlike TRUNCATE, it is logged and can be rolled back if executed within a transaction.

DROP:

Purpose: Completely removes a table (or other database objects like views, indexes) from the database, including its structure and data.

In [ ]:
import sqlite3

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create the 'employees' table
cursor.execute('''
CREATE TABLE employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    salary REAL,
    department TEXT
)
''')

# Insert sample data
cursor.executemany('''
INSERT INTO employees (name, salary, department) VALUES (?, ?, ?)
''', [
    ('John', 6000, 'IT'),
    ('Alice', 4000, 'HR'),
    ('Bob', 8000, 'IT'),
    ('Eve', 3000, 'Finance'),
    ('Charlie', 7000, 'IT')
])

# Example of DELETE (removes specific rows)
cursor.execute('''
DELETE FROM employees WHERE name = 'John'
''')

# Example of TRUNCATE (removes all rows but keeps the table)
cursor.execute('''
DELETE FROM employees
''')  # SQLite doesn't have a TRUNCATE command, but DELETE without WHERE acts similarly
print("After DELETE:")
cursor.execute('SELECT * FROM employees')
print(cursor.fetchall())

# Example of DROP (removes the table completely)
cursor.execute('DROP TABLE employees')

# Trying to select after DROP (this will throw an error since the table is dropped)
try:
    cursor.execute('SELECT * FROM employees')
    print(cursor.fetchall())
except sqlite3.OperationalError as e:
    print("Error:", e)

# Close the connection
conn.close()

After DELETE:
[]
Error: no such table: employees

# BASIC SQL CODES

In [8]:
import sqlite3

# Create a database in memory
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create a sample table
cursor.execute('''
CREATE TABLE employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    salary REAL,
    department TEXT
)
''')

In [9]:
# Insert sample data
cursor.executemany('''
INSERT INTO employees (name, salary, department) VALUES (?, ?, ?)
''', [
    ('Alice', 50000, 'HR'),
    ('Bob', 60000, 'Engineering'),
    ('Charlie', 70000, 'Engineering'),
    ('David', 55000, 'Marketing'),
    ('Eve', 65000, 'HR')
])

# Commit the changes
conn.commit()

In [10]:
cursor.execute('SELECT department, AVG(salary) FROM employees GROUP BY department')
rows = cursor.fetchall()
for row in rows:
    print(row)

('Engineering', 65000.0)
('HR', 57500.0)
('Marketing', 55000.0)

In [11]:
cursor.execute('INSERT INTO employees (name, salary, department) VALUES (?, ?, ?)', ('Sumit',10000, 'Intern'))
conn.commit()

In [12]:
cursor.execute('SELECT * FROM employees')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 50000.0, 'HR')
(2, 'Bob', 60000.0, 'Engineering')
(3, 'Charlie', 70000.0, 'Engineering')
(4, 'David', 55000.0, 'Marketing')
(5, 'Eve', 65000.0, 'HR')
(6, 'Sumit', 10000.0, 'Intern')

In [13]:
cursor.execute('SELECT * FROM employees WHERE department = "Engineering"')
rows = cursor.fetchall()
for row in rows:
    print(row)

(2, 'Bob', 60000.0, 'Engineering')
(3, 'Charlie', 70000.0, 'Engineering')

In [14]:
cursor.execute('UPDATE employees SET salary = ? WHERE name = ?', (20000, 'Sumit'))
conn.commit()

In [15]:
cursor.execute('SELECT * FROM employees')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 50000.0, 'HR')
(2, 'Bob', 60000.0, 'Engineering')
(3, 'Charlie', 70000.0, 'Engineering')
(4, 'David', 55000.0, 'Marketing')
(5, 'Eve', 65000.0, 'HR')
(6, 'Sumit', 20000.0, 'Intern')

In [16]:
cursor.execute('DELETE FROM employees WHERE name = ?', ('Amit',))
conn.commit()

In [17]:
cursor.execute('SELECT * FROM employees')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 50000.0, 'HR')
(2, 'Bob', 60000.0, 'Engineering')
(3, 'Charlie', 70000.0, 'Engineering')
(4, 'David', 55000.0, 'Marketing')
(5, 'Eve', 65000.0, 'HR')
(6, 'Sumit', 20000.0, 'Intern')

In [18]:
conn.close()